[XSkin_UIArmory_EquipmentSelect]
m_strReskinWeaponsTitle = "更换武器外观"

m_strRemoveAllSkinsNavHelpButtonTitle = "移除所有武器外观"
m_strRemoveAllSkinsNavHelpButtonTooltip = "移除该士兵身上所有武器外观。"
m_strRemoveAllSkinsDialogTitle = "移除所有武器外观？"
m_strRemoveAllSkinsDialogText = "确定要移除该士兵身上所有武器外观？"

m_strFiltersNavHelpButtonTitle = "过滤器"

m_strSearchButtonTitle = "搜索"
m_strSearchButtonTooltip = "按名称搜索特定外观"
m_strSearchFieldTitle = "输入外观部分名称"

[UIPanel_SkinOptions]
strRescaleWeaponSliderText = "武器尺寸："

[XComGameState_XSkin_FilterSettings]
m_strFilterByWeaponCategoryButtonTitle = "种类：已打开"
m_strFilterByWeaponCategoryButtonTooltip = "单击可禁用武器种类过滤器。您可将武器外观更换为不同武器种类的外观。这可能会导致不稳定的行为。"
m_strFilterByWeaponCategoryButtonTitle_Disabled = "种类：已关闭"
m_strFilterByWeaponCategoryButtonTooltip_Disabled = "单击可启用武器种类过滤器。您只能将武器外观更换为与武器种类相同的外观。"

m_strFilterByInventorySlotButtonTitle = "槽位：已打开"
m_strFilterByInventorySlotButtonTooltip = "单击可禁用装备槽位过滤器。您能够将该武器外观更换为适用于其他装备槽位的外观。这可能导致不稳定的行为。"
m_strFilterByInventorySlotButtonTitle_Disabled = "槽位：已关闭"
m_strFilterByInventorySlotButtonTooltip_Disabled = "单击可启用装备槽位过滤器。您只能将该武器外观更换为适用于该装备槽位的外观。"

m_strFilterByOwnedItemsButtonTitle = "已拥有：已打开"
m_strFilterByOwnedItemsButtonTooltip = "单击可禁用已拥有装备过滤器。您能够将武器外观更换为未拥有的武器的外观。"
m_strFilterByOwnedItemsButtonTitle_Disabled = "已拥有：已关闭"
m_strFilterByOwnedItemsButtonTooltip_Disabled = "单击可启用已拥有装备过滤器。您只能将武器外观更换为已拥有的武器的外观。"

m_strFilterByEquippableItemsButtonTitle = "可装备：已打开"
m_strFilterByEquippableItemsButtonTooltip = "单击可禁用可装备物品过滤器。您能够将武器外观更换为该士兵通常无法装备的武器的外观。"
m_strFilterByEquippableItemsButtonTitle_Disabled = "可装备：已关闭"
m_strFilterByEquippableItemsButtonTooltip_Disabled = "单击可启用可装备物品过滤器。您只能将武器外观更换该士兵潜在可装备的武器的外观。"

m_strFilterBySkinSetsButtonTitle = "外观设置：已打开"
m_strFilterBySkinSetsButtonTooltip = "单击可禁用外观过滤器。 您能够将装备更换为任意外观或不属于任何外观武器的外观。"
m_strFilterBySkinSetsButtonTitle_Disabled = "外观设置：已关闭"
m_strFilterBySkinSetsButtonTooltip_Disabled = "单击可启用外观过滤器。您只能将该武器外观更换其所属外观中武器的外观。"

m_strFilterBySortingTierButtonTitle = "层级：已打开"
m_strFilterBySortingTierButtonTooltip = "单击可禁用层级过滤器。您能够使用具有任何层级的武器的外观。"
m_strFilterBySortingTierButtonTitle_Disabled = "层级：已关闭"
m_strFilterBySortingTierButtonTooltip_Disabled = "单击可启用层级过滤器。您只能够使用层级低于或等于所选武器武器的外观。"

[UISkinFIlterSelect]
m_strTitleLabel = "武器外观过滤器"

m_strFilterByWeaponCategoryLabel = "武器种类匹配"
m_strFilterByWeaponCategoryToolTip = "禁用时，您可以将武器外观更换为另一种武器种类。这可能会导致不稳定的行为。"

m_strFilterByInventorySlotLabel = "装备槽位匹配"
m_strFilterByInventorySlotToolTip = "禁用时，您能够将此武器外观更换为其他装备槽位的武器。这可能会导致不稳定的行为。"

m_strFilterByOwnedItemsLabel = "仅限已拥有物品"
m_strFilterByOwnedItemsToolTip = "启用时，您将只能使用您已拥有武器的外观。"

m_strFilterByEquippableItemsLabel = "仅限可装备物品"
m_strFilterByEquippableItemsToolTip = "启用时，您将只能使用该士兵可装备武器的外观。"

m_strFilterBySkinSetsLabel = "外观预置匹配"
m_strFilterBySkinSetsToolTip = "启用时，您只能将该武器外观更换为它外观预置中武器的外观。"

m_strFilterBySortingTierLabel = "层级排序"
m_strFilterBySortingTierToolTip = "启用时，您能够使用层级低于或等于所选武器的外观。"

;	================================================
;				MOD CONFIG MENU
;	------------------------------------------------

[UISL_MCM]
str_SORT_SKIN_LIST_ALPHABETICALLY = "按字母顺序排序外观列表"
str_SORT_SKIN_LIST_BY_SORTING_TIER = "按层级顺序排序外观列表"
str_MARK_RESKINNED_WEAPONS = "标记已换外观武器"
str_REPLACE_RESKINNED_WEAPONS_LOADOUT_IMAGE = "替换已换外观武器的装备图像"
str_RENAME_RESKINNED_WEAPONS = "重命名已换外观武器"

str_WEAPON_CATEGORY_FILTER_STATUS = "武器种类过滤器"
str_INVENTORY_SLOT_FILTER_STATUS = "装备槽位过滤器"
str_OWNED_ITEMS_FILTER_STATUS = "已拥有过滤器"
str_EQUIPPABLE_ITEMS_FILTER_STATUS = "可装备过滤器"
str_SKIN_SETS_FILTER_STATUS = "外观预置过滤器"
str_SORTING_TIER_FILTER_STATUS = "层级过滤器"

str_eXSFS_Hidden_OFF = "隐藏并始终禁用"
str_eXSFS_Hidden_ON = "隐藏并始终启用"
str_eXSFS_Locked_OFF = "锁定并始终禁用"
str_eXSFS_Locked_ON = "锁定并始终启用"
str_eXSFS_Visible_OFF = "默认为可见和禁用"
str_eXSFS_Visible_ON = "默认为可见和启用"

str_REMEMBER_FILTER_SETTINGS = "记住过滤器设置"


str_SORT_SKIN_LIST_ALPHABETICALLY_TOOLTIP = "外观将根据他们的游戏名称进行分类。"
str_SORT_SKIN_LIST_BY_SORTING_TIER_TOOLTIP = "层级通常对应装备的技术等级，但未必对应改装过(mod-added)的武器。"
str_MARK_RESKINNED_WEAPONS_TOOLTIP = "已更换外观的装备是否应该用特殊图标来标记。"
str_REPLACE_RESKINNED_WEAPONS_LOADOUT_IMAGE_TOOLTIP = "已更换外观的装备是否应该使用武器外观的库存图像。战术模式无效。"
str_RENAME_RESKINNED_WEAPONS_TOOLTIP = "装备在已更换外观时是否应该自动重命名。如果玩家已经给装备进行自定义命名，那么装备就不会被重命名。"

str_WEAPON_CATEGORY_FILTER_STATUS_TOOLTIP = "过滤器被启用时，您只能使用与您想要更换外观的武器相同的武器种类的武器外观，例如突击步枪。"
str_INVENTORY_SLOT_FILTER_STATUS_TOOLTIP = "过滤器被启用时，您可以使用武器的外观，通常只能在相同的装备槽位的武器更换外观，例如主武器。"
str_OWNED_ITEMS_FILTER_STATUS_TOOLTIP = "过滤器被启用时，您可以使用复仇者号库存中存在的武器外观。"
str_EQUIPPABLE_ITEMS_FILTER_STATUS_TOOLTIP = "过滤器被启用时，您可以使用士兵可能装备的武器外观。"
str_SKIN_SETS_FILTER_STATUS_TOOLTIP = "过滤器被启用时，当前选择的武器只能从XComSkinSets.ini中配置的相同外观集中的外观。"
str_SORTING_TIER_FILTER_STATUS_TOOLTIP = "过滤器被启用时，您可以使用排序层级低于或等于您想更换外观的武器的外观。层级通常对应装备的技术等级。"

str_REMEMBER_FILTER_SETTINGS_TOOLTIP = "当您在士兵之间切换和重新启动游戏时，武器外观管理器是否应该记住过滤器设置。"

str_MOD_LABEL = "武器外观管理器"
str_GROUP_GENERAL_SETTINGS = "常规设置"
str_GROUP_FILTER_SETTINGS = "外观过滤器设置"
